Revit 2027 API
ElementIdParameterValue.Value Property
 The stored value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Value { get; set; }
Public Property Value As ElementId
	Get
	Set
public:
property ElementId^ Value {
	ElementId^ get ();
	void set (ElementId^ value);
}
member Value : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace